Revit 2024 API
FabricationConfiguration.GetAncillaries Method
 Gets fabrication ancillaries of the specified type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public IList<int> GetAncillaries(
	FabricationAncillaryType type,
	bool includeKits,
	bool filterKits
)
Visual Basic
Public Function GetAncillaries ( _
	type As FabricationAncillaryType, _
	includeKits As Boolean, _
	filterKits As Boolean _
) As IList(Of Integer)
Visual C++
public:
IList<int>^ GetAncillaries(
	FabricationAncillaryType type,
	bool includeKits,
	bool filterKits
)
Parameters
type
Type: Autodesk.Revit.DB.Fabrication.FabricationAncillaryType
 The type of ancillaries to get.
includeKits
Type: System.Boolean
 Whether or not to include ancillary kits as well.
filterKits
Type: System.Boolean
 Whether kits should be filtered to only those that contain the specified ancillary type.
Return Value
 An array of ancillary identifiers.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace